Revit 2024 API
SchemaBuilder.Ready Method
 Checks whether the builder may be used.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool Ready()
Visual Basic
Public Function Ready As Boolean
Visual C++
public:
bool Ready()
Return Value
 True if the SchemaBuilder has not yet been finished.
Remarks
 All newly constructed SchemaBuilders are usable until the call to the Finish method.
See Also
SchemaBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace